package array7;

public class ManageStudents {
    public static void main(String[] args) {

        // 학번 , 국어 , 수학 , 영어
        int [][] arr = {
                {1001, 100, 20, 32},
                {1002, 40, 43, 12},
                {1003, 60, 21, 42},
                {1004, 76, 54, 55},
                {1005, 23, 11, 76},
        };

        //[문제1] 모든 점수의 총합 출력

        //[문제2] 국어1등 번호 출력

        //[문제3] 수학1등 번호 출력

        //[문제4] 영어1등 번호 출력

        //[문제5] 전체1등 번호 출력

        //[문제6] 수학점수가 국어 점수 보다 높은 번호 출력

        //[문제6] 각점수의 총합을 아래 배열에 저장후 출력
        int total[] = new int[5];

        //[문제7] 전체 점수기준으로 등수를 저장후 출력
        int rank[] = new int[5];

    }

}
